tap "atomicjar/tap"
tap "catppuccin/tap"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "gromgit/brewtils"
tap "koekeishiya/formulae"
tap "mvndaemon/mvnd"
tap "nikitabobko/tap"

brew "awscli"
brew "bat"
brew "btop"
brew "carapace"
brew "cloc"
brew "dive"
brew "eksctl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "golangci-lint"
brew "helm"
brew "jq"
brew "k6"
brew "ktlint"
brew "lazydocker"
brew "lazygit"
brew "maven"
brew "mercurial"
brew "nmap"
brew "ollama"
brew "opencode"
brew "pandoc"
brew "pyenv"
brew "starship"
brew "stow"
brew "terraform"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "catppuccin/tap/catwalk"
brew "catppuccin/tap/whiskers"
brew "derailed/k9s/k9s"
brew "gromgit/brewtils/taproom"
brew "mvndaemon/mvnd/mvnd"

cask "basictex"
cask "brave-browser"
cask "calibre"
cask "claude"
cask "deepl"
cask "drawio"
cask "font-hack-nerd-font"
cask "freelens"
cask "ghostty", args: { appdir: "~/Applications" }
cask "github"
cask "karabiner-elements"
cask "keka"
cask "keystore-explorer"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "lm-studio"
cask "macfuse"
cask "marta"
cask "mongodb-compass"
cask "pearcleaner"
cask "pgadmin4"
cask "postman"
cask "rectangle"
cask "sublime-text"
cask "visual-studio-code"
